backend/controllers/CourseController.php

    protected function findModel($id)
    {
        if (($model = Course::findOne($id)) !== null) {
---
SELECT * FROM `course` WHERE `id`='1'