backend/controllers/StudentController.php

    protected function findModel($id)
    {
        if (($model = Student::findOne($id)) !== null) {
---
SELECT * FROM `student` WHERE `id`='1'