backend/views/student/_form.php

SELECT * FROM `user` WHERE `status`=10 ORDER BY `id`
---
    <?= $form->field($model, 'enrollment_status')->textInput(['maxlength' => true]) ?>

    <?php
      $students= ArrayHelper::map(User::find()->where(['status'=>10])->orderBy('id')->all(),'id','username');